{
  "activation": "silu",
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "cls_token": "[CLS]",
  "cls_token_id": 2003,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "initializer_range": 0.02,
  "intermediate_size": 2048,
  "layer_norm_eps": 1e-12,
  "mask_token": "[MASK]",
  "mask_token_id": 2001,
  "max_position_embeddings": 2000,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token": "[PAD]",
  "pad_token_id": 2002,
  "position_embedding_type": "rotary",
  "rope_theta": 10000,
  "rotary_dim": 64,
  "sep_token": "[SEP]",
  "sep_token_id": 2004,
  "transformers_version": "4.48.0",
  "type_vocab_size": 2,
  "unk_token": "[UNK]",
  "unk_token_id": 2005,
  "use_cache": true,
  "use_flash_attention": true,
  "vocab_size": 2006
}
